Wstęp do informatyki/wyklad/wstęp do informatyki 02 wyklad.org
#+title: Wstęp do informatyki wylkad 2, Systemy liczbowe z ograniczoną długością rejestru.
* System NKB$_{(N)}$
#+begin_latex
\begin{tabular}{rccccc}
\cline{2-6}
\text{Rejestr: } &  \multicolumn{1}{|c|}{a$_{N-1}} & \multicolumn{1}{|c|}{a_{N-2}} & \dots & \multicolumn{1}{|c|}{a_{1}} & \multicolumn{1}{|c|}{a$_0} \\
\cline{2-6}
\text{Wagi cyfr: } & 2^{N-1} & 2^{N-2} & & 2^1 & 2^0 \\
\end{tabular}
#+end_latex
\\
Zakres: L$_{\text{NKB}}(N)} = [0,2^{N}-1]$
* System U2$_{(N)}$
#+begin_latex
\begin{tabular}{rccccc}
\cline{2-6}
\text{Rejestr: } &  \multicolumn{1}{|c|}{a$_{N-1}} & \multicolumn{1}{|c|}{a_{N-2}} & \dots & \multicolumn{1}{|c|}{a_{1}} & \multicolumn{1}{|c|}{a$_0} \\
\cline{2-6}
\text{Wagi cyfr: } & -2^{N-1} & 2^{N-2} & & 2^1 & 2^0 \\
\end{tabular}
#+end_latex
\\
Zakres: L$_{\text{U2}(N)} = [-2^{N-1},2^{N-1}-1]$
* DEC $\to$ NKB_{(N)}
#+begin_latex
\begin{tabular}{rl|l}
\begin{aligned}
    L$_{\text{DEC}} : 2 =& W_0 & R_0 \\
    W_0 : 2 =& W_1 & R_1 \\
    &\vdots & \vdots \\
    W_{N-2} : 2 =& W_{N-1} & R_{N-1} \\
\hline
    W_{N-1} : 2  =& W_{N} & R_N \\
    W_{N} : 2 =& W_{N+1} & R_{N+1} \\
    &\vdots  & \vdots \\
    W_{M-1} : 2 = & 0 & R_{M-1}
\end{aligned}
\end{tabular}
#+end_latex
* NKB$_N \to$ DEC
$$\text{L}_{\text{DEC}} = \sum_{i=0}^{N-1}a_i \times 2^{i} $$
* DEC $\to$ U2$_{(N)}$
1) [[DEC $\to$ NKB_{(N)}][DEC $\to$ NKB_{(N)}]]
2)
   + Dla L$_{\text{DEC} \geq 0}$ KONIEC;
   + Dla L$_{\text{DEC} < 0}$ Zamiana znaku
** Zamiana znaku
#+begin_latex

\begin{tabular}{l|c|c|c|c|c|l}
\cline{2-6}
\text{a)} & a_{N-1} & a_{N-2} & \dots & a_1 & a_2 & = A_{\text{U2}(N)}=L_{\text{DEC}}\\
\cline{2-6}
\noalign{\smallskip}
\cline{2-6}
\text{b)} & \overline{a_{N-1}} & \overline{a_{N-2}} & \dots & \overline{a_1} & \overline{a_2} \\
\cline{2-6}
\noalign{\smallskip}
\cline{2-6}
+ & 0 & 0 & \dots & 0 & 1 \\
\cline{2-6}
\noalign{\smallskip}
\cline{2-6}
= & b_{(N-1)} & b_{(N-2)} & \dots & b_1 & b_2 & = B_{\text{U2}(N)} = L_{\text{DEC}}\\
\cline{2-6}
\end{tabular}
#+end_latex
** Warunek
$$ L_{\text{DEC}} = \left[ -2^{N-1}, 2^{N-1}-1} \right] $$
Innaczej się nie zmieści w rejestrze
** Przykłady
*** L_{\text{DEC}} = 127

#+begin_latex
\begin{tabular}{ll}
L_{\text{NKB}&=01111111 \\
L_{\text{U2}&=01111111
\end{tabular}
#+end_latex
*** L_{\text{DEC}} = -127

#+begin_latex
\begin{tabular}{rll}
|L_{\text{DEC}}| = L_{\text{NKB}(8)} =& 01111111 \\
& 10000000 \\
+& 00000001 \\
\cline{2-2}
&10000001_{\text{U2}(8)} & =-128
\end{tabular}
#+end_latex
*** L_{\text{DEC}} = 128

L$_{\text{NKB}(8)}=10000000_{\text{NKB}(8)}$

L$_{\text{U2}(8)} \neq 10000000_{\text{U2}(8)} = -128_{\text{DEC}}$
*** L_{\text{DEC}} = -128

#+begin_latex
\begin{tabular}{rll}
|L_{\text{DEC}}|=&10000000 \\
&01111111 \\
+&00000001\\
\cline{2-2}
&10000000_{\text{U2}(8)}&=-128

\end{tabular}
#+end_latex
* NKB$_{N} \to \text{U2}_{N}$
Nie istnieje!

Zmiana Interpretacji
* $\text{NKB}_N \to \text{U2}_M , M > N$
Istneje

* $\text{U2}_{(N)} \to \text{NKB}_{(N)}$
*Nie istnieje*

* $\text{U2}_{(M)} \to \text{NKB}_{(N)}$
Nie istnieje dla dowolnego $M>0,N>0$ .
* Jakieś pierdoły
- $A_{\text{DEC}}=128$
- $B_{\text{DEC}}=127$
- $A_{\text{U2}(8)} > B_{\text{U2}(8)} =$ FALSE
- $A_{\text{U2}(16)} > B_{\text{U2}(16)} =$ TRUE
* $\text{NKB}_{N} \to \text{NKB}_{(8)}, M > N$
-
#+begin_latex
\begin{tabular}{rccccc}
\cline{2-6}
\text{L$_{\text{NKB}_{(N)}}$} =&  \multicolumn{1}{|c|}{a$_{N-1}} & \multicolumn{1}{|c|}{a_{N-2}} & \dots & \multicolumn{1}{|c|}{a_{1}} & \multicolumn{1}{|c|}{a$_0} \\
\cline{2-6}
\end{tabular}
\left_{\text{NKB}$(N)$}
#+end_latex
-
#+begin_latex
\begin{tabular}{l|c|c|c|c|c|c|c|c|c|}
\cline{2-9}
L$_{\text{NKB}(M)} = & 0 & 0 & \dots & a_{N-1} & a_{N-2} & \dots & a_1 & a_0 \\
\cline{2-9}
\end{tabular}
\left_{\text{NKB}$(N)$}
#+end_latex
* $\text{NKB}_{(N)} \to \text{NKB}_{(M)}, M < N \\$ i $\text{U2}_{(N)} \to \text{U2}_{(M)}, M < N$
#+begin_latex
\begin{tabular}{l|c|c|c|c|c|}
\cline{2-6}
L_{\text{NKB}(N) \lor \text{U2}(N)} =& a_{N-1} & a$_{N-2}$ & \dots & a_1 & a_0 \\
\cline{2-6}
\end{tabular}

\begin{tabular}{l|c|c|c|c|}
\cline{2-5}
L_{\text{NKB}(M) \lor \text{U2(N)}} =& a$_{M-2}$ & \dots & a_1 & a_0 \\
\cline{2-5}

\end{tabular}
#+end_latex
